In [1]:
import pandas as pd

In [4]:
df = pd.read_excel('student.xlsx', index_col='학번')
df

     이름    학교  국어점수   수학점수  평균  취미
학번
1번  김자바  자바학교     70    90  80   운동
2번  이자바  자바학교     80    80  80   독서
3번  박자바  자바학교     90   100  95   등산
4번  김캐드  캐드학교     60    70  65  NaN
5번  정캐드  캐드학교     80    80  80  NaN

## 컬럼 선택(label)

In [6]:
df['이름']
df[['이름', '학교']]

     이름    학교
학번
1번  김자바  자바학교
2번  이자바  자바학교
3번  박자바  자바학교
4번  김캐드  캐드학교
5번  정캐드  캐드학교

## 컬럼선택(정수 Index)

In [8]:
df.columns

Index(['이름', '학교', '국어점수 ', '수학점수', '평균', '취미 '], dtype='object')

In [9]:
df.columns[0]

'이름'

In [11]:
df[df.columns[0]]
df[df.columns[-1]] #가장 마지막 컬럼값을 가져옴

학번
1번     운동
2번     독서
3번     등산
4번    NaN
5번    NaN
Name: 취미 , dtype: object

In [13]:
df['수학점수'][:3]

학번
1번     90
2번     80
3번    100
Name: 수학점수, dtype: int64

In [14]:
df[['이름', '평균']][:4]

     이름  평균
학번
1번  김자바  80
2번  이자바  80
3번  박자바  95
4번  김캐드  65

In [15]:
df[2:]

     이름    학교  국어점수   수학점수  평균  취미
학번
3번  박자바  자바학교     90   100  95   등산
4번  김캐드  캐드학교     60    70  65  NaN
5번  정캐드  캐드학교     80    80  80  NaN